GopalSaraf/Practicals/PSDL/include/proc/pic16c924.inc
// Register: PORTF
#define PORTF PORTF
PORTF                                    equ 0107h
// bitfield definitions
PORTF_RF0_POSN                           equ 0000h
PORTF_RF0_POSITION                       equ 0000h
PORTF_RF0_SIZE                           equ 0001h
PORTF_RF0_LENGTH                         equ 0001h
PORTF_RF0_MASK                           equ 0001h
PORTF_RF1_POSN                           equ 0001h
PORTF_RF1_POSITION                       equ 0001h
PORTF_RF1_SIZE                           equ 0001h
PORTF_RF1_LENGTH                         equ 0001h
PORTF_RF1_MASK                           equ 0002h
PORTF_RF2_POSN                           equ 0002h
PORTF_RF2_POSITION                       equ 0002h
PORTF_RF2_SIZE                           equ 0001h
PORTF_RF2_LENGTH                         equ 0001h
PORTF_RF2_MASK                           equ 0004h
PORTF_RF3_POSN                           equ 0003h
PORTF_RF3_POSITION                       equ 0003h
PORTF_RF3_SIZE                           equ 0001h
PORTF_RF3_LENGTH                         equ 0001h
PORTF_RF3_MASK                           equ 0008h
PORTF_RF4_POSN                           equ 0004h
PORTF_RF4_POSITION                       equ 0004h
PORTF_RF4_SIZE                           equ 0001h
PORTF_RF4_LENGTH                         equ 0001h
PORTF_RF4_MASK                           equ 0010h
PORTF_RF5_POSN                           equ 0005h
PORTF_RF5_POSITION                       equ 0005h
PORTF_RF5_SIZE                           equ 0001h
PORTF_RF5_LENGTH                         equ 0001h
PORTF_RF5_MASK                           equ 0020h
PORTF_RF6_POSN                           equ 0006h
PORTF_RF6_POSITION                       equ 0006h
PORTF_RF6_SIZE                           equ 0001h
PORTF_RF6_LENGTH                         equ 0001h
PORTF_RF6_MASK                           equ 0040h
PORTF_RF7_POSN                           equ 0007h
PORTF_RF7_POSITION                       equ 0007h
PORTF_RF7_SIZE                           equ 0001h
PORTF_RF7_LENGTH                         equ 0001h
PORTF_RF7_MASK                           equ 0080h

// Register: PORTG
#define PORTG PORTG
PORTG                                    equ 0108h
// bitfield definitions
PORTG_RG0_POSN                           equ 0000h
PORTG_RG0_POSITION                       equ 0000h
PORTG_RG0_SIZE                           equ 0001h
PORTG_RG0_LENGTH                         equ 0001h
PORTG_RG0_MASK                           equ 0001h
PORTG_RG1_POSN                           equ 0001h
PORTG_RG1_POSITION                       equ 0001h
PORTG_RG1_SIZE                           equ 0001h
PORTG_RG1_LENGTH                         equ 0001h
PORTG_RG1_MASK                           equ 0002h
PORTG_RG2_POSN                           equ 0002h
PORTG_RG2_POSITION                       equ 0002h
PORTG_RG2_SIZE                           equ 0001h
PORTG_RG2_LENGTH                         equ 0001h
PORTG_RG2_MASK                           equ 0004h
PORTG_RG3_POSN                           equ 0003h
PORTG_RG3_POSITION                       equ 0003h
PORTG_RG3_SIZE                           equ 0001h
PORTG_RG3_LENGTH                         equ 0001h
PORTG_RG3_MASK                           equ 0008h
PORTG_RG4_POSN                           equ 0004h
PORTG_RG4_POSITION                       equ 0004h
PORTG_RG4_SIZE                           equ 0001h
PORTG_RG4_LENGTH                         equ 0001h
PORTG_RG4_MASK                           equ 0010h
PORTG_RG5_POSN                           equ 0005h
PORTG_RG5_POSITION                       equ 0005h
PORTG_RG5_SIZE                           equ 0001h
PORTG_RG5_LENGTH                         equ 0001h
PORTG_RG5_MASK                           equ 0020h
PORTG_RG6_POSN                           equ 0006h
PORTG_RG6_POSITION                       equ 0006h
PORTG_RG6_SIZE                           equ 0001h
PORTG_RG6_LENGTH                         equ 0001h
PORTG_RG6_MASK                           equ 0040h
PORTG_RG7_POSN                           equ 0007h
PORTG_RG7_POSITION                       equ 0007h
PORTG_RG7_SIZE                           equ 0001h
PORTG_RG7_LENGTH                         equ 0001h
PORTG_RG7_MASK                           equ 0080h

// Register: LCDSE
#define LCDSE LCDSE
LCDSE                                    equ 010Dh
// bitfield definitions
LCDSE_SE0_POSN                           equ 0000h
LCDSE_SE0_POSITION                       equ 0000h
LCDSE_SE0_SIZE                           equ 0001h
LCDSE_SE0_LENGTH                         equ 0001h
LCDSE_SE0_MASK                           equ 0001h
LCDSE_SE5_POSN                           equ 0001h
LCDSE_SE5_POSITION                       equ 0001h
LCDSE_SE5_SIZE                           equ 0001h
LCDSE_SE5_LENGTH                         equ 0001h
LCDSE_SE5_MASK                           equ 0002h
LCDSE_SE9_POSN                           equ 0002h
LCDSE_SE9_POSITION                       equ 0002h
LCDSE_SE9_SIZE                           equ 0001h
LCDSE_SE9_LENGTH                         equ 0001h
LCDSE_SE9_MASK                           equ 0004h
LCDSE_SE12_POSN                          equ 0003h
LCDSE_SE12_POSITION                      equ 0003h
LCDSE_SE12_SIZE                          equ 0001h
LCDSE_SE12_LENGTH                        equ 0001h
LCDSE_SE12_MASK                          equ 0008h
LCDSE_SE16_POSN                          equ 0004h
LCDSE_SE16_POSITION                      equ 0004h
LCDSE_SE16_SIZE                          equ 0001h
LCDSE_SE16_LENGTH                        equ 0001h
LCDSE_SE16_MASK                          equ 0010h
LCDSE_SE20_POSN                          equ 0005h
LCDSE_SE20_POSITION                      equ 0005h
LCDSE_SE20_SIZE                          equ 0001h
LCDSE_SE20_LENGTH                        equ 0001h
LCDSE_SE20_MASK                          equ 0020h
LCDSE_SE27_POSN                          equ 0006h
LCDSE_SE27_POSITION                      equ 0006h
LCDSE_SE27_SIZE                          equ 0001h
LCDSE_SE27_LENGTH                        equ 0001h
LCDSE_SE27_MASK                          equ 0040h
LCDSE_SE29_POSN                          equ 0007h
LCDSE_SE29_POSITION                      equ 0007h
LCDSE_SE29_SIZE                          equ 0001h
LCDSE_SE29_LENGTH                        equ 0001h
LCDSE_SE29_MASK                          equ 0080h

// Register: LCDPS
#define LCDPS LCDPS
LCDPS                                    equ 010Eh
// bitfield definitions
LCDPS_LP_POSN                            equ 0000h
LCDPS_LP_POSITION                        equ 0000h
LCDPS_LP_SIZE                            equ 0004h
LCDPS_LP_LENGTH                          equ 0004h
LCDPS_LP_MASK                            equ 000Fh
LCDPS_LP0_POSN                           equ 0000h
LCDPS_LP0_POSITION                       equ 0000h
LCDPS_LP0_SIZE                           equ 0001h
LCDPS_LP0_LENGTH                         equ 0001h
LCDPS_LP0_MASK                           equ 0001h
LCDPS_LP1_POSN                           equ 0001h
LCDPS_LP1_POSITION                       equ 0001h
LCDPS_LP1_SIZE                           equ 0001h
LCDPS_LP1_LENGTH                         equ 0001h
LCDPS_LP1_MASK                           equ 0002h
LCDPS_LP2_POSN                           equ 0002h
LCDPS_LP2_POSITION                       equ 0002h
LCDPS_LP2_SIZE                           equ 0001h
LCDPS_LP2_LENGTH                         equ 0001h
LCDPS_LP2_MASK                           equ 0004h
LCDPS_LP3_POSN                           equ 0003h
LCDPS_LP3_POSITION                       equ 0003h
LCDPS_LP3_SIZE                           equ 0001h
LCDPS_LP3_LENGTH                         equ 0001h
LCDPS_LP3_MASK                           equ 0008h

